// 문제 - 1937년 Collatz란 사람에 의해 제기된 이 추측은, 주어진 수가 1이 될 때까지 다음 작업을 반복하면, 
// 모든 수를 1로 만들 수 있다는 추측입니다. 작업은 다음과 같습니다.

// 1-1. 입력된 수가 짝수라면 2로 나눕니다. 
// 1-2. 입력된 수가 홀수라면 3을 곱하고 1을 더합니다. 
// 2. 결과로 나온 수에 같은 작업을 1이 될 때까지 반복합니다.

// 예를 들어, 주어진 수가 6이라면 6 → 3 → 10 → 5 → 16 → 8 → 4 → 2 → 1 이 되어 총 8번 만에 1이 됩니다.
// 위 작업을 몇 번이나 반복해야 하는지 반환하는 함수, solution을 완성해 주세요. 단, 주어진 수가 1인 경우에는 0을,
// 작업을 500번 반복할 때까지 1이 되지 않는다면 –1을 반환해 주세요.

// 제한 사항
// 입력된 수, num은 1 이상 8,000,000 미만인 정수입니다.

function solution(num) {
    var answer = 0;
    for (let i = 0; i < 500; i++){  // 500번 반복 제한
        if (num !== 1){
            num = num % 2 === 0? num / 2 : num * 3 + 1;
        } else {
            return answer = i;
        }
    }
    return answer = -1;
}

// 먼저, i의 값이 500번 반복해도 1이 안되면 -1를 반환해야 하기 때문에 i < 500 조건을 걸고 return이 없을 때, -1를 반환
// 주어진 num이 1이 될 때까지 반복해야 하기 때문에 조건문으로 num !== 1 일때, 삼항연산자로 짝수(num % 2 === 0)를 체크하여
// ture 일때 1-1 연산을, false 일때 1-2 연산을 적용했다. 그리고 else로 i 값 리턴. 500번이 넘어가면 for문이 종료되고 -1이 리턴된다.
